
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>蓝屏 - windbg模块解析 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-intopic-toc/style.css">
                

<p>&#x52A0;&#x8F7D;&#x4E86; blackboxbsd.dll &#x6269;&#x5C55;&#x6765;&#x5206;&#x6790;BSD&#x78C1;&#x76D8;&#x5B50;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<ul>
<li>BLACKBOXNTFS: 1 (!blackboxntfs)</li>
</ul>
<p>&#x52A0;&#x8F7D;&#x4E86; blackboxntfs.dll &#x6269;&#x5C55;&#x6765;&#x5206;&#x6790;NTFS&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<ul>
<li>BLACKBOXPNP: 1 (!blackboxpnp)</li>
</ul>
<p>&#x52A0;&#x8F7D;&#x4E86; blackboxpnp.dll &#x6269;&#x5C55;&#x6765;&#x5206;&#x6790;&#x5373;&#x63D2;&#x5373;&#x7528;(PnP)&#x4E0E;&#x7535;&#x6E90;&#x7BA1;&#x7406;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6CA1;&#x5565;&#x7528;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x8D85;&#x9891;&#x4E86;</p>
<p>&#x9ED1;&#x7BB1;&#x6269;&#x5C55;&#x7531;&#x5FAE;&#x8F6F;&#x63D0;&#x4F9B;,&#x5305;&#x542B;&#x8BB8;&#x591A;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x5206;&#x6790;Windows&#x5185;&#x6838;&#x548C;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x76F8;&#x5173;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x811A;&#x672C;&#x4E0E;&#x5DE5;&#x5177;&#x3002;&#x901A;&#x8FC7;&#x52A0;&#x8F7D;&#x4E0D;&#x540C;&#x7684;&#x9ED1;&#x7BB1;&#x6269;&#x5C55;,WinDbg&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x9A71;&#x52A8;&#x548C;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x5206;&#x6790;&#x6765;&#x67E5;&#x627E;&#x6F5C;&#x5728;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x70B9;&#x51FB;&#x540E;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x4E0D;&#x540C;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x62A5;&#x9519;&#x8FDB;&#x7A0B;&#x548C;&#x6B21;&#x6570;">&#x62A5;&#x9519;&#x8FDB;&#x7A0B;&#x548C;&#x6B21;&#x6570;</h2>
<p>&#x8FD9;&#x662F;&#x5173;&#x952E;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x76F4;&#x767D;&#x7684;&#x544A;&#x8BC9;&#x4F60;&#x662F;&#x54EA;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x62A5;&#x9519;&#x548C;&#x8FD9;&#x662F;&#x7B2C;&#x51E0;&#x6B21;&#x53D1;&#x751F;&#x7684;&#x62A5;&#x9519;</p>
<p><img src="IRQL&#x84DD;&#x5C4F;&#x5206;&#x6790;/image-20230611235226852.png" alt="image-20230611235226852"></p>
<p>&#x672C;&#x673A;&#x62A5;&#x9519;&#x662F;&#x7531;<code>msedge.exe</code>&#x8FDB;&#x7A0B;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x8FD9;&#x662F;edge&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E3B;&#x8FDB;&#x7A0B;&#xFF0C;&#x8FD9;&#x6B63;&#x597D;&#x5BF9;&#x5E94;&#x4E86;&#x6211;&#x5728;&#x5173;&#x95ED;&#x6D4F;&#x89C8;&#x5668;&#x65F6;&#x53D1;&#x751F;&#x84DD;&#x5C4F;&#x7684;&#x65F6;&#x95F4;&#x8282;&#x70B9;&#x3002;</p>
<h2 id="&#x5BC4;&#x5B58;&#x5668;&#x72B6;&#x6001;">&#x5BC4;&#x5B58;&#x5668;&#x72B6;&#x6001;</h2>
<h3 id="trap-frame">trap frame</h3>
<p>&#x65E0;&#x8BBA;3&#x73AF;&#x662F;&#x4ECE;&#x4E2D;&#x65AD;&#x95E8;&#x8FD8;&#x662F;systementer&#x8FDB;&#x5165;0&#x73AF;&#xFF0C;3&#x73AF;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x4F1A;&#x5BC4;&#x5B58;&#x5728;_Trap_Frame&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x547D;&#x4EE4;<code>dt _KTrap_Frame</code>&#x53EF;&#x4EE5;&#x4ECE;windbg&#x4E2D;&#x67E5;&#x770B;&#x8BE5;&#x7ED3;&#x6784;&#x4F53;</p>
<pre><code>6: kd&gt; dt _KTrap_Frame
nt!_KTRAP_FRAME
   +0x000 P1Home           : Uint8B
   +0x008 P2Home           : Uint8B
   +0x010 P3Home           : Uint8B
   +0x018 P4Home           : Uint8B
   +0x020 P5               : Uint8B
   +0x028 PreviousMode     : Char
   +0x028 InterruptRetpolineState : UChar
   +0x029 PreviousIrql     : UChar
   +0x02a FaultIndicator   : UChar
   +0x02a NmiMsrIbrs       : UChar
   +0x02b ExceptionActive  : UChar
   +0x02c MxCsr            : Uint4B
   +0x030 Rax              : Uint8B
   +0x038 Rcx              : Uint8B
   +0x040 Rdx              : Uint8B
   +0x048 R8               : Uint8B
   +0x050 R9               : Uint8B
   +0x058 R10              : Uint8B
   +0x060 R11              : Uint8B
   +0x068 GsBase           : Uint8B
   +0x068 GsSwap           : Uint8B
   +0x070 Xmm0             : _M128A
   +0x080 Xmm1             : _M128A
   +0x090 Xmm2             : _M128A
   +0x0a0 Xmm3             : _M128A
   +0x0b0 Xmm4             : _M128A
   +0x0c0 Xmm5             : _M128A
   +0x0d0 FaultAddress     : Uint8B
   +0x0d0 ContextRecord    : Uint8B
   +0x0d8 Dr0              : Uint8B
   +0x0e0 Dr1              : Uint8B
   +0x0e8 Dr2              : Uint8B
   +0x0f0 Dr3              : Uint8B
   +0x0f8 Dr6              : Uint8B
   +0x100 Dr7              : Uint8B
   +0x0d8 ShadowStackFrame : Uint8B
   +0x0e0 Spare            : [5] Uint8B
   +0x108 DebugControl     : Uint8B
   +0x110 LastBranchToRip  : Uint8B
   +0x118 LastBranchFromRip : Uint8B
   +0x120 LastExceptionToRip : Uint8B
   +0x128 LastExceptionFromRip : Uint8B
   +0x130 SegDs            : Uint2B
   +0x132 SegEs            : Uint2B
   +0x134 SegFs            : Uint2B
   +0x136 SegGs            : Uint2B
   +0x138 TrapFrame        : Uint8B
   +0x140 Rbx              : Uint8B
   +0x148 Rdi              : Uint8B
   +0x150 Rsi              : Uint8B
   +0x158 Rbp              : Uint8B
   +0x160 ErrorCode        : Uint8B
   +0x160 ExceptionFrame   : Uint8B
   +0x168 Rip              : Uint8B
   +0x170 SegCs            : Uint2B
   +0x172 Fill0            : UChar
   +0x173 Logging          : UChar
   +0x174 Fill1            : [2] Uint2B
   +0x178 EFlags           : Uint4B
   +0x17c Fill2            : Uint4B
   +0x180 Rsp              : Uint8B
   +0x188 SegSs            : Uint2B
   +0x18a Fill3            : Uint2B
   +0x18c Fill4            : Uint4B
</code></pre><p>&#x501F;&#x7528;csdn&#x4E2D;&#x7684;&#x4E00;&#x4F4D;&#x535A;&#x4E3B;&#x7684;&#x56FE;&#x7247;&#xFF1A;&#x6211;&#x662F;win11 64&#x4F4D;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x73AF;&#x5883;&#x672A;&#x77E5;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x51FA;&#x5165;&#x3002;</p>
<p><img src="IRQL&#x84DD;&#x5C4F;&#x5206;&#x6790;/20191207215316421.png" alt="20191207215316421"></p>
<p><img src="IRQL&#x84DD;&#x5C4F;&#x5206;&#x6790;/image-20230611235601152.png" alt="image-20230611235601152"></p>
